<template>
	<view class="box">

		<u-cell-group>
			<u-cell-item v-for="(item,index) in titleText" :key="index" :title="item" @click='report(index)'></u-cell-item>
		</u-cell-group>

	</view>
</template>

<script>
	export default {
		data() {
			return {
				titleText: [
					'烤灯',
					'喷枪',
					'点焊机',
					'烤漆房',
					'干磨机',
					'扭力扳手',
					'四轮定位仪',
					'制动试验台',
					'双柱举升机',
					'四柱举升机',
					'剪式举升机',
					'大梁校正仪',
					'大灯检测仪',
					'轮胎拆装机',
					'空气压缩机',
					'电瓶测试仪',
					'动平衡校正仪',
					'蓄电池充电机',
					'燃油抽吸装置',
					'刹车油加注机',
					'空调冷媒加注机',
					'液压地藏式举升机',
				],
				TotalEquipmentData: [{
						// 烤灯
						Data: [' 烤灯整体支架焊接缝检查	', '烤灯整体绝缘检查	', '烤灯变压器检查	', '烤灯安全指示标识状况	', '烤灯供电线缆老化状况	', '灯管完整及清洁检查	', '烤灯移动脚轮老化状况	',
							'烤灯操作按键及显示屏使用状况	', '烤灯定时器及温控器工作状况	', '烤灯是否按规定定期保养维护	', '设备整体性能现场测试	'
						]
					},
					{
						// 喷枪
						Data: ['喷枪整体外观状况	', '喷枪整体密封状况	', '喷枪供气接头磨损状况	', '喷枪供气压力调节阀使用状况', '喷枪供气压力表使用状况	', '喷枪操作开关使用状况	', '喷枪喷嘴调节阀使用状况	',
							'喷枪是否按规定定期保养维护', '设备整体性能现场测试	'
						]
					},
					{
						// 点焊机
						Data: ['点焊机自检是否可以通过	', '显示器以及外观按键检查	', '程序是否正常	', '点焊机内部尘土检查	', '点焊机和电缆的绝缘情况检查	', '焊枪是否有磨损	', '焊枪焊接处是否开裂	',
							'焊枪电极是否正常	', '点焊机冷却液检查	', '水冷系统检查（是否漏水）	', '平衡器检查	', '辅助悬臂及吊鼓使用状况	', '电焊机焊接效果是否良好	'
						]
					},
					{
						// 烤漆房
						Data: ['烤漆房房体是否变形	燃烧器：调节风门检查', '烤漆房门密封状况检查	燃烧器：调节风门检查', '地基支撑框架及地网格使用状况	', '烤漆房进排风机及加热部位外板密封状况	',
							'控制柜检测：线路检查 接触器检查 电器开关检查	', '烤漆房控制面板及显示面板使用状况	', '进排风电机工作状况	', '燃烧器：调节风门检查	燃烧器：调节风门检查',
							'光感器：检测使用状态检查	光感器：检测使用状态检查', '点火电极间距检查	点火电极间距检查', '燃烧器与油桶距离检查	燃烧器与油桶距离检查', '喷油嘴：清洁检查	喷油嘴：清洁检查',
							'进油过滤器：清洁检查	进油过滤器：清洁检查', '燃烧机/炉胆是否开裂变形	锅炉：清洁检查', '燃烧机/炉胆残留物是否过多	锅炉：清洁检查', '进、排风管道检查	', '排风电机风门的清洁检查',
							'房体内压检查：调节（+/-5pa）', '传感器工作情况（压力传感器，温度传感器）', '温度控制系统是否升温过长	', '照明灯检查	', '烤漆房VOC过滤系统	', '线路老化检查	',
							'电器控制元件触点氧化检查	', '烤漆房是否按规定定期保养维护	', '设备整体性能现场测试	'
						]
					},
					{
						// 干磨机
						Data: ['干磨机整体外观状况	', '干磨机供电线缆老化状况	', '干磨机供气管线及接头老化状况	', '干磨机供气润滑伺服系统工作状况	', '干磨机三合一套管使用状况	',
							'干磨机主机各控制开关及旋钮使用状况	', '干磨机主机内部电机及线路工作状况	', '干磨机配套附件是否齐全完好	', '干磨机配套磨头工作状况	', '吸尘系统的检查	', '干磨机是否按规定定期保养维护	',
							'设备整体性能现场测试	', '管路密封情况检查	'
						]
					},
					{
						// 扭力扳手
						Data: ['棘轮是否有磨损	', '棘轮换向器是否不灵活	', '棘轮齿轮是否磨损	', '手柄是否跳尺	', '手柄是否有磨损	', '手柄焊接处是否开裂	', '手柄锁止是否正常	', '是否按规定定期保养维护	',
							'设备整体性能现场测试	'
						]
					},
					{
						// 四轮定位仪
						Data: ['机身焊接面的检查	', '电脑主机及显示器的检查（含主机运行速度与状态）	', '机箱内电路板的清洁和检查	', '传感器固定装置的检查	', '传感器连接线的检查	', '传感器壳体是否变形	',
							'传感器支架是否变形	', '转角盘是否锈蚀	', '转角盘是否开裂	', '轮盘锁检查	', '刹车锁检查	', '摄像头检查/是否准确	', '电源工作状况	', '设备是否按规定定期保养维护	',
							'设备整体性能现场测试	'
						]
					},
					{
						// 制动试验台
						Data: ['基坑检查（是否脏污、锈蚀)	', '机柜及主机使用状况	', '台体及侧滑板使用状况	', '动力电源电路 供电线缆检查	', '轴重传感器检查	', '第三轴传感器检查	', '接近开关调整检查	',
							'电机检查	', '计算机/显示屏系统检查	', '轴重传感器标定检查	', '制动传感器标定检查	', '控制系统标定检查	', '滚筒磨损状况	', '紧急停止开关工作状况	', '主板检查	',
							'设备是否按规定定期保养维护	', '设备整体性能现场测试	'
						]
					},

					{
						// 双柱举升机
						Data: [
							'举升机外观状况', '举升机安全标识状况', '立柱是否有磨损', '立柱焊接处是否开裂', '立柱折弯处是否开裂', '立柱是否垂直', '滑台是否有磨损', '滑台焊接处是否开裂', '滑台折弯处是否开裂',
							'托臂是否下垂', '托臂方管是否开裂', '焊接处是否开裂', '缆纶是否磨损', '缆纶是否开裂', '皮带磨损/开裂情况', '液压系统（含油管）工作状况', '丝杠传动系统工作状况', '同步钢丝绳磨损状况',
							'安全锁止机构工作状况', '电气系统工作状况', '各安全开关及限位开关工作状况', '主板以及继电器工作状况', '电机工作情况（电路，噪音等）', '举升机底板情况',
							'所有固定螺栓紧固状况/是否紧固达到扭力要求', '设备是否按规定定期保养维护', '设备整体性能现场测试'
						]
					},
					{
						// 四柱举升机
						Data: ['举升机外观状况 	', '举升机安全标识状况	', '立柱是否有磨损	', '立柱焊接处是否开裂	', '立柱折弯处是否开裂	', '立柱是否垂直	', '前后横梁结构状况	', '跑板是否有磨损	',
							'跑板焊接处是否开裂	', '跑板折弯处是否开裂	', '油管状况（是否老化/松动）	', '钢丝绳磨损/老化状况	', '保险锁是否变形	', '保险锁是否磨损	', '缆轮磨损状况	',
							'滑台情况（是否磨损/开裂）	', '液压系统工作状况	', '丝杠传动系统工作状况	', '主板以及继电器工作状况	', '电机工作情况（电路，噪音等）	', '开关工作情况	', '举升机底板情况	',
							'所有固定螺栓紧固状况/是否紧固达到扭力要求	', '设备是否按规定定期保养维护	', '设备整体性能现场测试	'
						]
					},
					{
						// 剪式举升机
						Data: ['举升机外观状况 	', '举升机安全标识状况	', '剪刀支臂是否弯曲或扭曲变形	', '剪刀支臂焊接处是否开裂	', '剪刀支臂连接孔是否磨损	', '剪刀支臂连接轴和套是否有磨损	',
							'平台台面是否磨损	', '平台折弯处是否开裂	', '平台焊接处是否开裂	', '平台水平情况	', '油管是否老化	', '油管接头是否松动	', '保险齿是否变形	', '保险齿是否磨损	',
							'液压系统工作状况	', '保险锁是否变形	', '保险锁是否磨损	', '主板以及继电器工作状况	', '电机工作情况（电路，噪音等）	', '开关工作情况	', '举升机底板情况	',
							'所有固定螺栓紧固状况/是否紧固达到扭力要求	', '设备是否按规定定期保养维护	', '设备整体性能现场测试	'
						]
					},
					{
						// 大梁校正仪
						Data: ['机柜及电脑主机外观	', '主机蓝牙是否正常	', '主机是否反映过慢	', '主机程序是否解锁	', '模具是否有磨损	', '模具是否开裂	', '测量滑尺使用状况	', '测量电子尺使用状况	',
							'拉塔外观磨损程度	', '拉塔是否磨损变形漏油', '保险钢丝是否变形	', '保险钢丝是否磨损	', '软件是否升级	'
						]
					},
					{
						// 大灯检测仪
						Data: ['主机是否有磨损	', '大灯小车与轨道垂直度检查	', '轨道水平检查	', '焊接处是否开裂	', '透镜是否磨损	', '反光镜是否磨损	', '反光镜是否开裂	', '反光镜是否丢失	',
							'镭射红外线检查	', '光源成像板检查	光源成像板检查', '测试光照度传感检查	测试光照度传感检查'
						]
					},
					{
						// 轮胎拆装机
						Data: ['主机及辅助臂焊接点的检查	', '主机机箱内的清洁检查	', '电机及皮带的检查	', '换气阀的清洁及检查	', '鸟头的检查及保护套的更换检查	', '轮胎夹具的清洁润滑及夹具保护套的更换检查',
							'轮胎铲气缸的清洁润滑及保护套的检查	', '辅助臂气缸的检查清洁检查	', '辅助臂托臂是否下垂	', '辅助臂托臂方管是否开裂	', '辅助臂轮胎压轮的润滑检查	', '辅助壁焊接处是否开裂	',
							'气动开关灵活性的检查	', '电路的检查	', '气路的检查	', '主板以及继电器工作状况	', '电机工作情况（电路，噪音等）	', '所有固定螺栓紧固状况/是否紧固达到扭力要求',
							'设备是否按规定定期保养维护	', '设备整体性能现场测试	'
						]
					},
					{
						// 空气压缩机
						Data: ['泵头状态	', '油位是否减少	', '加压时间是否正常	', '水份过滤是否正常	', '油路过滤是否正常	', '出气温度是否降低	', '是否按规定定期保养维护	', '设备整体性能现场测试	']

					},
					{
						// 电瓶测试仪
						Data: ['整体外观状况	', '外部电缆线是否正常	', '操作按键及显示屏使用状况	', '主机时钟模块是否正常	', '打印机输出设备使用情况	']

					},
					{
						// 动平衡校正仪
						Data: ['体外观状况	', '设备机箱内的清洁检查	', '机箱内电路板的清洁和接线桩的检查', '传动部分及轴承的清洁和润滑检查', '皮带的检查	', '电机的检查	', '标定检查	',
							'气动部件的需检查气动部分	', '平衡机的清洁检查	', '夹具的清洁和润滑检查	', '按键及显示面板使用状况	', '配套椎体使用状况	', '配套紧固旋具使用状况	', '配套量尺使用状况	',
							'主板以及继电器工作状况	', '电机工作情况（电路，噪音等）	', '设备是否按规定定期保养维护	', '设备整体性能现场测试	'
						]
					},
					{
						// 蓄电池充电机
						Data: ['蓄电池充电机整体外观状况	', '蓄电池充电机安全指示标识状况	', '蓄电池充电机供电线缆使用状况	', '蓄电池充电机充电线缆使用状况	', '蓄电池充电机操作按键及显示屏使用状况',
							'蓄电池充电机是否按规定定期保养维护	', '设备整体性能现场测试	', '是否按规定定期保养维护	'
						]
					}, {
						// 燃油抽吸装置
						Data: [
							'燃油抽吸装置整体外观状况	', '燃油抽吸装置储油罐密封状况	', '油桶是否磨损	', '油桶焊接处是否开裂	', '油桶油位显示是否正常	', '燃油抽吸装置外部管线及接头使用状况	',
							'燃油抽吸装置内部油泵及管路工作状况	', '燃油抽吸装置操作开关及调节阀门使用状况', '油泵是否有异响	', '油泵压力是否正常	', '油泵滤芯是否正常	', '燃油抽吸装置静电装置检查	',
							'燃油抽吸装置是否按规定保养维护	', '设备整体性能现场测试	'

						]
					}, {
						// 刹车油加注机
						Data: ['主机是否有腐蚀', '主机压力是否正常', '泵是否异响', '油管压力表是否正常', '油管是否有磨损', '油管是否漏油', '设备是否按规定保养维护	', '设备整体性能现场测试	'

						]
					}, {
						// 空调冷媒加注机
						Data: ['设备外观检查	', '电气安全检查	', '外部管线及快速接头密封状况	', '储媒罐及内部管路密封状况	', '操作按键及显示屏使用状况	', '压力表使用状况	', '干燥过滤器更换检查	',
							'真空泵电机状况	', '各油瓶使用状况检查	', '称重传感器精度状况	', '压缩机工作状况（压力, 异响）', '设备自检	', '设备标定检查	', '显示屏提示信息检查	', '是否按规定定期保养维护	',
							'设备整体性能现场测试	'
						]
					}, {
						// 液压地藏式举升机
						Data: [
							'举升机外观状况 	', '举升机安全标识状况	', '控制机柜线路是否老化	', '控制机油管是否老化	', '箱体是否生锈	', '箱体是否有积水	', '支撑平台或支臂是否生锈	',
							'支撑平台或支臂台面是否磨损	', '支撑平台或支臂台面是否开裂	', '支撑平台或支臂台面焊接处是否开裂	', '举升机二次举升机平台检查（如具备）	', '保险锁是否磨损	', '保险锁是否变形	',
							'液压泵是否异响	', '液压泵是否开裂	', '保险横梁是否变形	', '保险衡量是否磨损	', '主板以及继电器工作状况	', '电机工作情况（电路，噪音等）	', '开关工作情况	', '举升机底板情况	',
							'所有固定螺栓紧固状况/是否紧固达到扭力要求	', '设备是否按规定定期保养维护	', '设备整体性能现场测试	'
						]
					},
					
					
					// 电瓶测试仪   刹车油加注机   复制问题
				]
			};
		},
		onBackPress() {
			uni.navigateTo({
				url: "../work.8",
			});
			return true
		},
		created() {
		},
		methods: {
			report: function(indexs) {
				let that = this
				uni.scanCode({
					success: function(res) {
						if (res.result.split('?')[0] == 'http://icms.inchwell.com.cn/web/gotoinchwell.html') {
							that.$store.state.report = res.result.split('=')[1]
							console.log(res.result.split('=')[1])
							that.$store.state.TotalEquText  = that.titleText[indexs] 
							that.$store.state.TotalEquipmentData = that.TotalEquipmentData[indexs].Data
							uni.navigateTo({
								url: "./report",
							});
						}
					}
				});
			}
		}
		// 默认返回路径

	}
</script>

<style lang="scss">

</style>
